fish/.config/fish/config.org
#+title: My Fish configuration
#+options: toc:2
#+property: header-args :tangle config.fish
#+setupfile: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup


Welcome to my configuration. It's always a work in progress.

* Setting up PATHS
** Universal system folders

These paths generally exist on most every system so we'll set them separate from other PATH additions.

#+begin_src fish
set -xg PATH /usr/local/bin /usr/bin /usr/sbin /sbin /bin /usr/local/sbin /opt/X11/bin $PATH
#+end_src

** macOS specific items

At first glance, having two references to ~Emacs.app~ seems silly but the ~emacs~ and ~emacsclient~ executables live in separate directories. How annoying!

#+begin_src fish
set -xg PATH /usr/local/opt /Applications/Emacs.app/Contents/MacOS/bin /Applications/Emacs.app/Contents/MacOS $PATH
#+end_src
* Initialisation

This section consists of helpers functions and global variables used by various applications.

A few of the helper functions are intended to make sure my configuration acts mostly identical across all machines and OSes without any extra configuration.

Whether that statement holds true is... debatable :)

** Determining the current OS

In order to save having to remember how to use ~uname~ and all that, I just have my own little configuration within my shell that I can reference

#+begin_src fish
if string match -q '*microsoft*' -- (uname -r)
    set OPSYS "windows"
else
    set OPSYS (string lower (uname))
end
#+end_src

Windows is a bit of a misnomer here because what I'm really checking for is whether the shell is running inside of [[https://docs.microsoft.com/en-us/windows/wsl/about][Windows Subsystem for Linux (WSL)]]

Functionally, I can treat WSL and Linux the same (and I do) but there are some minor alterations I make use of, such as pointing the ~DISPLAY~ environment variable at an X display server on my host system

It's worth noting that the value of ~$OPSYS~ on ~macOS~ is ~darwin~. I could change it to be clearer but [[https://en.wikipedia.org/wiki/Darwin_(operating_system)][Darwin]] is technically the correct name for the base operating system

** Setting my workspace

All of my development occurs in ~$HOME/Code~ regardless of what machine I'm on. One day I might change it though hence the variable.

#+begin_src fish
set -x WORKSPACE ~/Code
#+end_src

** Setting various global constants

#+begin_src fish
set -x CONFIG_FILE ~/.config/fish/config.fish
set -x CONFIG_SRC  ~/.config/fish/config.org
set -x EDITOR      (command -v emacs)client -c # (1)
set -x GPG_TTY     (tty)
set -x LANGUAGE    "en_NZ:en"
#+end_src

1. In some cases, when I compile Emacs, I'm not able to find the ~emacsclient~ executiable within my path.

   This doesn't really make much sense given ~emacs~ and ~emacsclient~ tend to live side by side and I don't actually remember the specific details from last time I ran into that problem.

   In the event that happens anyway, this quick hack (find ~emacs~ and append "client" on the end) works in the meantime

** Setting some Windows / WSL specific constants

#+begin_src fish
if test $OPSYS = "windows"
    set -x DISPLAY (cat /etc/resolv.conf | grep nameserver | awk '{print $2; exit;}'):0.0 # (1)
    set -x BROWSER "/mnt/c/Windows/explorer.exe" # (2)
end
#+end_src


1. If I'm running on a Windows machine, I run Emacs by starting a daemon inside my terminal and connecting with ~emacsclient~. Doing so spawns a new frame using the X display server running on the Windows host itself

2. While I don't believe this actually works, I attempt to override the ~BROWSER~ environment variable to open links on the Windows host from within Emacs
** Convenience functions
I had to remind myself why this exists but it's just a convenience function to make my configuration slightly more readable

#+begin_src fish
alias scut="abbr -a -g"
#+end_src

* Applications and Languages
