fish/.config/fish/config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-06 Mon 16:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Fish configuration</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Marcus Crane" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">My Fish configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga94184c">1. Setting up PATHS</a>
<ul>
<li><a href="#orgd499e7c">1.1. Universal system folders</a></li>
<li><a href="#org1295cc4">1.2. macOS specific items</a></li>
</ul>
</li>
<li><a href="#orgafd7670">2. Initialisation</a>
<ul>
<li><a href="#orgb6c1ff9">2.1. Determining the current OS</a></li>
<li><a href="#org841a4da">2.2. Setting my workspace</a></li>
<li><a href="#org8ebc9fe">2.3. Setting various global constants</a></li>
<li><a href="#orgfe94053">2.4. Setting some Windows / WSL specific constants</a></li>
<li><a href="#orgf789c85">2.5. Convenience functions</a></li>
</ul>
</li>
<li><a href="#orga0505af">3. Applications and Languages</a>
<ul>
<li><a href="#orgc03e6c0">3.1. asdf</a></li>
<li><a href="#org986601c">3.2. Dropbox</a></li>
<li><a href="#orgf987523">3.3. Emacs</a></li>
<li><a href="#orgc16ce58">3.4. Erlang</a></li>
<li><a href="#orgf23f971">3.5. git</a></li>
<li><a href="#org3a49140">3.6. go</a></li>
<li><a href="#org9f8f66e">3.7. Homebrew</a></li>
<li><a href="#org18b2933">3.8. Python</a></li>
<li><a href="#org38382b7">3.9. Rust</a></li>
</ul>
</li>
<li><a href="#orgd4feb90">4. Shortcuts</a></li>
</ul>
</div>
</div>
<p>
Welcome to my configuration. It&rsquo;s always a work in progress.
</p>

<div id="outline-container-orga94184c" class="outline-2">
<h2 id="orga94184c"><span class="section-number-2">1</span> Setting up PATHS</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd499e7c" class="outline-3">
<h3 id="orgd499e7c"><span class="section-number-3">1.1</span> Universal system folders</h3>
<div class="outline-text-3" id="text-1-1">
<p>
These paths generally exist on most every system so we&rsquo;ll set them separate from other PATH additions.
</p>

<div class="org-src-container">
<pre class="src src-fish"><span style="color: #51afef;">set</span> <span style="color: #51afef; font-weight: bold;">-xg</span> <span style="color: #dcaeea;">PATH</span> /usr/local/bin /usr/bin /usr/sbin /sbin /bin /usr/local/sbin /opt/X11/bin <span style="color: #98be65;">$</span><span style="color: #dcaeea;">PATH</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1295cc4" class="outline-3">
<h3 id="org1295cc4"><span class="section-number-3">1.2</span> macOS specific items</h3>
<div class="outline-text-3" id="text-1-2">
<p>
At first glance, having two references to <code>Emacs.app</code> seems silly but the <code>emacs</code> and <code>emacsclient</code> executables live in separate directories. How annoying!
</p>

<div class="org-src-container">
<pre class="src src-fish"><span style="color: #51afef;">set</span> <span style="color: #51afef; font-weight: bold;">-xg</span> <span style="color: #dcaeea;">PATH</span> /usr/local/opt /Applications/Emacs.app/Contents/MacOS/bin /Applications/Emacs.app/Contents/MacOS <span style="color: #98be65;">$</span><span style="color: #dcaeea;">PATH</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgafd7670" class="outline-2">
<h2 id="orgafd7670"><span class="section-number-2">2</span> Initialisation</h2>
<div class="outline-text-2" id="text-2">
<p>
This section consists of helpers functions and global variables used by various applications.
</p>

<p>
A few of the helper functions are intended to make sure my configuration acts mostly identical across all machines and OSes without any extra configuration.
</p>

<p>
Whether that statement holds true is&#x2026; debatable :)
</p>
</div>

<div id="outline-container-orgb6c1ff9" class="outline-3">
<h3 id="orgb6c1ff9"><span class="section-number-3">2.1</span> Determining the current OS</h3>
<div class="outline-text-3" id="text-2-1">
<p>
In order to save having to remember how to use <code>uname</code> and all that, I just have my own little configuration within my shell that I can reference
</p>

<div class="org-src-container">
<pre class="src src-fish"><span style="color: #51afef;">if</span> <span style="color: #c678dd;">string</span> match -q <span style="color: #98be65;">'*microsoft*'</span> -- (<span style="color: #c678dd;">uname</span> -r)
    <span style="color: #51afef;">set</span> <span style="color: #dcaeea;">OPSYS</span> <span style="color: #98be65;">"windows"</span>
<span style="color: #51afef;">else</span>
    <span style="color: #51afef;">set</span> <span style="color: #dcaeea;">OPSYS</span> (<span style="color: #c678dd;">string</span> lower (uname))
<span style="color: #51afef;">end</span>
</pre>
</div>

<p>
Windows is a bit of a misnomer here because what I&rsquo;m really checking for is whether the shell is running inside of <a href="https://docs.microsoft.com/en-us/windows/wsl/about">Windows Subsystem for Linux (WSL)</a>
</p>

<p>
Functionally, I can treat WSL and Linux the same (and I do) but there are some minor alterations I make use of, such as pointing the <code>DISPLAY</code> environment variable at an X display server on my host system
</p>

<p>
It&rsquo;s worth noting that the value of <code>$OPSYS</code> on <code>macOS</code> is <code>darwin</code>. I could change it to be clearer but <a href="https://en.wikipedia.org/wiki/Darwin_(operating_system)">Darwin</a> is technically the correct name for the base operating system
</p>
</div>
</div>

<div id="outline-container-org841a4da" class="outline-3">
<h3 id="org841a4da"><span class="section-number-3">2.2</span> Setting my workspace</h3>
<div class="outline-text-3" id="text-2-2">
<p>
All of my development occurs in <code>$HOME/Code</code> regardless of what machine I&rsquo;m on. One day I might change it though hence the variable.
</p>

<div class="org-src-container">
<pre class="src src-fish"><span style="color: #51afef;">set</span> <span style="color: #51afef; font-weight: bold;">-x</span> <span style="color: #dcaeea;">WORKSPACE</span> ~/Code
</pre>
</div>
</div>
</div>

<div id="outline-container-org8ebc9fe" class="outline-3">
<h3 id="org8ebc9fe"><span class="section-number-3">2.3</span> Setting various global constants</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-fish"><span style="color: #51afef;">set</span> <span style="color: #51afef; font-weight: bold;">-x</span> <span style="color: #dcaeea;">CONFIG_FILE</span> ~/.config/fish/config.<span style="color: #c678dd;">fish</span>
<span style="color: #51afef;">set</span> <span style="color: #51afef; font-weight: bold;">-x</span> <span style="color: #dcaeea;">CONFIG_SRC</span>  ~/.config/fish/config.org
<span style="color: #51afef;">set</span> <span style="color: #51afef; font-weight: bold;">-x</span> <span style="color: #dcaeea;">EDITOR</span>      (<span style="color: #c678dd;">command</span> -v emacs)client -c <span style="color: #5B6268;"># </span><span style="color: #5B6268;">(1)</span>
<span style="color: #51afef;">set</span> <span style="color: #51afef; font-weight: bold;">-x</span> <span style="color: #dcaeea;">GPG_TTY</span>     (<span style="color: #c678dd;">tty</span>)
<span style="color: #51afef;">set</span> <span style="color: #51afef; font-weight: bold;">-x</span> <span style="color: #dcaeea;">LANGUAGE</span>    <span style="color: #98be65;">"en_NZ:en"</span>
</pre>
</div>

<ol class="org-ol">
<li><p>
In some cases, when I compile Emacs, I&rsquo;m not able to find the <code>emacsclient</code> executiable within my path.
</p>

<p>
This doesn&rsquo;t really make much sense given <code>emacs</code> and <code>emacsclient</code> tend to live side by side and I don&rsquo;t actually remember the specific details from last time I ran into that problem.
</p>

<p>
In the event that happens anyway, this quick hack (find <code>emacs</code> and append &ldquo;client&rdquo; on the end) works in the meantime
</p></li>
</ol>
</div>
</div>

<div id="outline-container-orgfe94053" class="outline-3">
<h3 id="orgfe94053"><span class="section-number-3">2.4</span> Setting some Windows / WSL specific constants</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-fish"><span style="color: #51afef;">if</span> <span style="color: #51afef;">test</span> <span style="color: #98be65;">$</span><span style="color: #dcaeea;">OPSYS</span> = <span style="color: #98be65;">"windows"</span>
    <span style="color: #51afef;">set</span> <span style="color: #51afef; font-weight: bold;">-x</span> <span style="color: #dcaeea;">DISPLAY</span> (<span style="color: #c678dd;">cat</span> /etc/resolv.conf <span style="color: #51afef; font-weight: bold;">|</span> <span style="color: #c678dd;">grep</span> nameserver <span style="color: #51afef; font-weight: bold;">|</span> <span style="color: #c678dd;">awk</span> <span style="color: #98be65;">'{print $2; exit;}'</span>):<span style="color: #da8548; font-weight: bold;">0.0</span> <span style="color: #5B6268;"># </span><span style="color: #5B6268;">(1)</span>
    <span style="color: #51afef;">set</span> <span style="color: #51afef; font-weight: bold;">-x</span> <span style="color: #dcaeea;">BROWSER</span> <span style="color: #98be65;">"/mnt/c/Windows/explorer.exe"</span> <span style="color: #5B6268;"># </span><span style="color: #5B6268;">(2)</span>
<span style="color: #51afef;">end</span>
</pre>
</div>


<ol class="org-ol">
<li>If I&rsquo;m running on a Windows machine, I run Emacs by starting a daemon inside my terminal and connecting with <code>emacsclient</code>. Doing so spawns a new frame using the X display server running on the Windows host itself</li>

<li>While I don&rsquo;t believe this actually works, I attempt to override the <code>BROWSER</code> environment variable to open links on the Windows host from within Emacs</li>
</ol>
</div>
</div>
<div id="outline-container-orgf789c85" class="outline-3">
<h3 id="orgf789c85"><span class="section-number-3">2.5</span> Convenience functions</h3>
<div class="outline-text-3" id="text-2-5">
<p>
I had to remind myself why this exists but it&rsquo;s just a convenience function to make my configuration slightly more readable
</p>

<div class="org-src-container">
<pre class="src src-fish"><span style="color: #c678dd;">alias</span> scut=<span style="color: #98be65;">"abbr -a -g"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga0505af" class="outline-2">
<h2 id="orga0505af"><span class="section-number-2">3</span> Applications and Languages</h2>
<div class="outline-text-2" id="text-3">
</div>
