fish/.config/fish/config.org
** [[https://github.com/asdf-vm/asdf][asdf]]

The version manager to rule them all

It wraps a number of existing language version managers into plugins that can be managed through one unified CLI tool

#+begin_src fish
if test $OPSYS = "darwin"
    set -x ASDF_DIR (brew --prefix asdf) # (1)
else
    set -x ASDF_DIR ~/.asdf
end
if test -e $ASDF_DIR
    source $ASDF_DIR/asdf.fish
    if not test -e ~/.config/fish/completions
        mkdir -p ~/.config/fish/completions; and cp ~/.asdf/completions/asdf.fish ~/.config/fish/completions # (2)
    end
end
#+end_src

1. While I'm not sure if it's still the case, there used to be issues with ~asdf~ on ~macOS~ being unable to find versions installed using Brew as seen [[https://github.com/asdf-vm/asdf/issues/425#issuecomment-459751694][here]]

2. Autocompletions aren't added to Fish so this step, provided by the asdf docs, configures them properly

** Dart

Google's language for building cross-platform applications

#+begin_src fish
if test -e $ASDF_DIR; and test -e $ASDF_DIR/plugins/dart
    set -xg PATH (asdf where dart)/bin $PATH
end
#+end_src
** [[https://dropbox.cm][Dropbox]]

Depending on which computer I'm using, I'll often have my Dropbox in different places

Historically, it would only be in a different place when using Emacs in WSL (I store my org stuff in Dropbox)

I'm currently in the process of moving to Dropbox within WSL though, which will mean that all version of Dropbox will live in ~$HOME/Dropbox~

The reason for that is because file operations across WSL boundaries (ie anything on the C:\ Drive) is super slow compared to staying within the boundaries

#+begin_src fish
if test $OPSYS = "windows"; and test $NAME != "epitaph"
    set -x DROPBOX_DIR /mnt/c/Users/marcus.crane/Dropbox
else
    set -x DROPBOX_DIR ~/Dropbox
end
#+end_src

** Emacs

I'll probably configure this a fair bit more but for now, I just shorten the name of ~emacsclient~

#+begin_src fish
scut ec $EDITOR
#+end_src
** Erlang

Whenever I compile ~erlang~ (using ~asdf~), I always use the same flags so it's easier to just set them within my shell

#+begin_src fish
set -x KERL_CONFIGURE_OPTIONS "--disable-debug --without-javac"
set -x KERL_BUILD_DOCS "yes"
#+end_src
** Flutter

Google's framework for building cross-platform applications

#+begin_src fish
if test -e $ASDF_DIR; and test -e $ASDF_DIR/plugins/flutter
    set -xg PATH (asdf where flutter)/bin $PATH
end
#+end_src
** git

To save me having to set up each machine, I just set my Git identifiers each time

#+begin_src fish
git config --global user.name "Marcus Crane"
git config --global user.email "marcus@utf9k.net"
#+end_src

** go

While I don't write much golang, it's kind of annoying to set it up each time so I just leave working configuration in each of my shells in the event that I decide to do anything golang related

#+begin_src fish
set -x GOPATH $WORKSPACE/go
if test -e $ASDF_DIR; and test -e $ASDF_DIR/plugins/golang
    set -x GOROOT (asdf where golang)/go
end
set -xg PATH $GOPATH/bin $GOROOT $PATH
#+end_src
** Homebrew

Sometimes I have trouble with rsync which is about the only thing that this snippet fixes

#+begin_src fish
if test $OPSYS = "darwin"
    set -xg PATH /usr/bin/local $PATH
end
#+end_src

** Python

#+begin_src fish
if test -e $ASDF_DIR; and test -e $ASDF_DIR/plugins/python
    set -xg PATH (asdf where python)/bin $PATH
end
#+end_src

** Rust

#+begin_src fish
if test -e $ASDF_DIR; and test -e $ASDF_DIR/plugins/rust
    set -xg PATH (asdf where rust)/bin $PATH
end
#+end_src
