fish/.config/fish/config.html
<div id="outline-container-orgc03e6c0" class="outline-3">
<h3 id="orgc03e6c0"><span class="section-number-3">3.1</span> <a href="https://github.com/asdf-vm/asdf">asdf</a></h3>
<div class="outline-text-3" id="text-3-1">
<p>
The version manager to rule them all
</p>

<p>
It wraps a number of existing language version managers into plugins that can be managed through one unified CLI tool
</p>

<div class="org-src-container">
<pre class="src src-fish"><span style="color: #51afef;">if</span> <span style="color: #51afef;">test</span> <span style="color: #98be65;">$</span><span style="color: #dcaeea;">OPSYS</span> = <span style="color: #98be65;">"darwin"</span>
    <span style="color: #51afef;">set</span> <span style="color: #51afef; font-weight: bold;">-x</span> <span style="color: #dcaeea;">ASDF_DIR</span> (<span style="color: #c678dd;">brew</span> --prefix asdf) <span style="color: #5B6268;"># </span><span style="color: #5B6268;">(1)</span>
<span style="color: #51afef;">else</span>
    <span style="color: #51afef;">set</span> <span style="color: #51afef; font-weight: bold;">-x</span> <span style="color: #dcaeea;">ASDF_DIR</span> ~/.asdf
<span style="color: #51afef;">end</span>
<span style="color: #51afef;">if</span> <span style="color: #51afef;">test</span> -e <span style="color: #98be65;">$</span><span style="color: #dcaeea;">ASDF_DIR</span>
    <span style="color: #c678dd;">source</span> <span style="color: #98be65;">$</span><span style="color: #dcaeea;">ASDF_DIR/asdf</span>.<span style="color: #c678dd;">fish</span>
    <span style="color: #51afef;">if</span> <span style="color: #51afef; font-weight: bold;">not</span> <span style="color: #51afef;">test</span> -e ~/.config/fish/completions
        <span style="color: #c678dd;">mkdir</span> -p ~/.config/fish/completions; <span style="color: #51afef;">and</span> <span style="color: #c678dd;">cp</span> ~/.asdf/completions/asdf.<span style="color: #c678dd;">fish</span> ~/.config/fish/completions <span style="color: #5B6268;"># </span><span style="color: #5B6268;">(2)</span>
    <span style="color: #51afef;">end</span>
<span style="color: #51afef;">end</span>
</pre>
</div>

<ol class="org-ol">
<li>While I&rsquo;m not sure if it&rsquo;s still the case, there used to be issues with <code>asdf</code> on <code>macOS</code> being unable to find versions installed using Brew as seen <a href="https://github.com/asdf-vm/asdf/issues/425#issuecomment-459751694">here</a></li>

<li>Autocompletions aren&rsquo;t added to Fish so this step, provided by the asdf docs, configures them properly</li>
</ol>
</div>
</div>

<div id="outline-container-org986601c" class="outline-3">
<h3 id="org986601c"><span class="section-number-3">3.2</span> <a href="https://dropbox.cm">Dropbox</a></h3>
<div class="outline-text-3" id="text-3-2">
<p>
Depending on which computer I&rsquo;m using, I&rsquo;ll often have my Dropbox in different places
</p>

<p>
Historically, it would only be in a different place when using Emacs in WSL (I store my org stuff in Dropbox)
</p>

<p>
I&rsquo;m currently in the process of moving to Dropbox within WSL though, which will mean that all version of Dropbox will live in <code>$HOME/Dropbox</code>
</p>

<p>
The reason for that is because file operations across WSL boundaries (ie anything on the C:\ Drive) is super slow compared to staying within the boundaries
</p>

<div class="org-src-container">
<pre class="src src-fish"><span style="color: #51afef;">if</span> <span style="color: #51afef;">test</span> <span style="color: #98be65;">$</span><span style="color: #dcaeea;">OPSYS</span> = <span style="color: #98be65;">"windows"</span>; <span style="color: #51afef;">and</span> <span style="color: #51afef;">test</span> <span style="color: #98be65;">$</span><span style="color: #dcaeea;">NAME</span> != <span style="color: #98be65;">"epitaph"</span>
    <span style="color: #51afef;">set</span> <span style="color: #51afef; font-weight: bold;">-x</span> <span style="color: #dcaeea;">DROPBOX_DIR</span> /mnt/c/Users/marcus.crane/Dropbox
<span style="color: #51afef;">else</span>
    <span style="color: #51afef;">set</span> <span style="color: #51afef; font-weight: bold;">-x</span> <span style="color: #dcaeea;">DROPBOX_DIR</span> ~/Dropbox
<span style="color: #51afef;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf987523" class="outline-3">
<h3 id="orgf987523"><span class="section-number-3">3.3</span> Emacs</h3>
<div class="outline-text-3" id="text-3-3">
<p>
I&rsquo;ll probably configure this a fair bit more but for now, I just shorten the name of <code>emacsclient</code>
</p>

<div class="org-src-container">
<pre class="src src-fish"><span style="color: #c678dd;">scut</span> ec <span style="color: #98be65;">$</span><span style="color: #dcaeea;">EDITOR</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc16ce58" class="outline-3">
<h3 id="orgc16ce58"><span class="section-number-3">3.4</span> Erlang</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Whenever I compile <code>erlang</code> (using <code>asdf</code>), I always use the same flags so it&rsquo;s easier to just set them within my shell
</p>

<div class="org-src-container">
<pre class="src src-fish"><span style="color: #51afef;">set</span> <span style="color: #51afef; font-weight: bold;">-x</span> <span style="color: #dcaeea;">KERL_CONFIGURE_OPTIONS</span> <span style="color: #98be65;">"--disable-debug --without-javac"</span>
<span style="color: #51afef;">set</span> <span style="color: #51afef; font-weight: bold;">-x</span> <span style="color: #dcaeea;">KERL_BUILD_DOCS</span> <span style="color: #98be65;">"yes"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf23f971" class="outline-3">
<h3 id="orgf23f971"><span class="section-number-3">3.5</span> git</h3>
<div class="outline-text-3" id="text-3-5">
<p>
To save me having to set up each machine, I just set my Git identifiers each time
</p>

<div class="org-src-container">
<pre class="src src-fish"><span style="color: #c678dd;">git</span> config --global user.name <span style="color: #98be65;">"Marcus Crane"</span>
<span style="color: #c678dd;">git</span> config --global user.email <span style="color: #98be65;">"marcus@utf9k.net"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3a49140" class="outline-3">
<h3 id="org3a49140"><span class="section-number-3">3.6</span> go</h3>
<div class="outline-text-3" id="text-3-6">
<p>
While I don&rsquo;t write much golang, it&rsquo;s kind of annoying to set it up each time so I just leave working configuration in each of my shells in the event that I decide to do anything golang related
</p>

<div class="org-src-container">
<pre class="src src-fish"><span style="color: #51afef;">set</span> <span style="color: #51afef; font-weight: bold;">-x</span> <span style="color: #dcaeea;">GOPATH</span> <span style="color: #98be65;">$</span><span style="color: #dcaeea;">WORKSPACE/go</span>
<span style="color: #51afef;">if</span> <span style="color: #51afef;">test</span> -e <span style="color: #98be65;">$</span><span style="color: #dcaeea;">ASDF_DIR</span>; <span style="color: #51afef;">and</span> <span style="color: #51afef;">test</span> -e <span style="color: #98be65;">$</span><span style="color: #dcaeea;">ASDF_DIR/plugins/golang</span>
    <span style="color: #51afef;">set</span> <span style="color: #51afef; font-weight: bold;">-x</span> <span style="color: #dcaeea;">GOROOT</span> (<span style="color: #c678dd;">asdf</span> where golang)/go
<span style="color: #51afef;">end</span>
<span style="color: #51afef;">set</span> <span style="color: #51afef; font-weight: bold;">-xg</span> <span style="color: #dcaeea;">PATH</span> <span style="color: #98be65;">$</span><span style="color: #dcaeea;">GOPATH/bin</span> <span style="color: #98be65;">$</span><span style="color: #dcaeea;">GOROOT</span> <span style="color: #98be65;">$</span><span style="color: #dcaeea;">PATH</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9f8f66e" class="outline-3">
<h3 id="org9f8f66e"><span class="section-number-3">3.7</span> Homebrew</h3>
<div class="outline-text-3" id="text-3-7">
<p>
Sometimes I have trouble with rsync which is about the only thing that this snippet fixes
</p>

<div class="org-src-container">
<pre class="src src-fish"><span style="color: #51afef;">if</span> <span style="color: #51afef;">test</span> <span style="color: #98be65;">$</span><span style="color: #dcaeea;">OPSYS</span> = <span style="color: #98be65;">"darwin"</span>
    <span style="color: #51afef;">set</span> <span style="color: #51afef; font-weight: bold;">-xg</span> <span style="color: #dcaeea;">PATH</span> /usr/bin/local <span style="color: #98be65;">$</span><span style="color: #dcaeea;">PATH</span>
<span style="color: #51afef;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org18b2933" class="outline-3">
<h3 id="org18b2933"><span class="section-number-3">3.8</span> Python</h3>
<div class="outline-text-3" id="text-3-8">
<div class="org-src-container">
<pre class="src src-fish"><span style="color: #51afef;">if</span> <span style="color: #51afef;">test</span> -e <span style="color: #98be65;">$</span><span style="color: #dcaeea;">ASDF_DIR</span>; <span style="color: #51afef;">and</span> <span style="color: #51afef;">test</span> -e <span style="color: #98be65;">$</span><span style="color: #dcaeea;">ASDF_DIR/plugins/python</span>
    <span style="color: #51afef;">set</span> <span style="color: #51afef; font-weight: bold;">-xg</span> <span style="color: #dcaeea;">PATH</span> (<span style="color: #c678dd;">asdf</span> where python)/bin <span style="color: #98be65;">$</span><span style="color: #dcaeea;">PATH</span>
<span style="color: #51afef;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org38382b7" class="outline-3">
<h3 id="org38382b7"><span class="section-number-3">3.9</span> Rust</h3>
<div class="outline-text-3" id="text-3-9">
<div class="org-src-container">
<pre class="src src-fish"><span style="color: #51afef;">if</span> <span style="color: #51afef;">test</span> -e <span style="color: #98be65;">$</span><span style="color: #dcaeea;">ASDF_DIR</span>; <span style="color: #51afef;">and</span> <span style="color: #51afef;">test</span> -e <span style="color: #98be65;">$</span><span style="color: #dcaeea;">ASDF_DIR/plugins/rust</span>
    <span style="color: #51afef;">set</span> <span style="color: #51afef; font-weight: bold;">-xg</span> <span style="color: #dcaeea;">PATH</span> (<span style="color: #c678dd;">asdf</span> where rust)/bin <span style="color: #98be65;">$</span><span style="color: #dcaeea;">PATH</span>
<span style="color: #51afef;">end</span>
</pre>
</div>
</div>
</div>
</div>
