fish/.config/fish/config.org
* Shortcuts
A whole bunch of shortcuts, or as fish calls them, "abbreviations"

#+begin_src fish
scut ae      "deactivate &> /dev/null; source ./venv/bin/activate"
scut de      "deactivate &> /dev/null"
scut edit    "$EDITOR $CONFIG_SRC"
scut gb      "git branch -v"
scut gcm     "git commit -Si"
scut gr      "git remote -v"
scut gst     "git status"
scut pap     "git pull upstream master && git push origin master"
scut refresh "tangle $CONFIG_SRC && stow fish -d ~/dotfiles && source $CONFIG_FILE"
scut venv    "python3 -m virtualenv venv && ae"
scut vi      "nvim"
scut view    "less $CONFIG_FILE"
scut vim     "nvim"
scut ws      "cd $WORKSPACE"
#+end_src

# Local variables:
# eval: (add-hook 'after-save-hook 'org-html-export-to-html t t)
# end:
