fish/.config/fish/config.html
<div id="outline-container-orgd4feb90" class="outline-2">
<h2 id="orgd4feb90"><span class="section-number-2">4</span> Shortcuts</h2>
<div class="outline-text-2" id="text-4">
<p>
A whole bunch of shortcuts, or as fish calls them, &ldquo;abbreviations&rdquo;
</p>

<div class="org-src-container">
<pre class="src src-fish"><span style="color: #c678dd;">scut</span> ae      <span style="color: #98be65;">"deactivate &amp;&gt; /dev/null; source ./venv/bin/activate"</span>
<span style="color: #c678dd;">scut</span> de      <span style="color: #98be65;">"deactivate &amp;&gt; /dev/null"</span>
<span style="color: #c678dd;">scut</span> edit    <span style="color: #98be65;">"$EDITOR $CONFIG_SRC"</span>
<span style="color: #c678dd;">scut</span> gb      <span style="color: #98be65;">"git branch -v"</span>
<span style="color: #c678dd;">scut</span> gcm     <span style="color: #98be65;">"git commit -Si"</span>
<span style="color: #c678dd;">scut</span> gr      <span style="color: #98be65;">"git remote -v"</span>
<span style="color: #c678dd;">scut</span> gst     <span style="color: #98be65;">"git status"</span>
<span style="color: #c678dd;">scut</span> pap     <span style="color: #98be65;">"git pull upstream master &amp;&amp; git push origin master"</span>
<span style="color: #c678dd;">scut</span> refresh <span style="color: #98be65;">"tangle $CONFIG_SRC &amp;&amp; stow fish -d ~/dotfiles &amp;&amp; source $CONFIG_FILE"</span>
<span style="color: #c678dd;">scut</span> venv    <span style="color: #98be65;">"python3 -m virtualenv venv &amp;&amp; ae"</span>
<span style="color: #c678dd;">scut</span> vi      <span style="color: #98be65;">"nvim"</span>
<span style="color: #c678dd;">scut</span> view    <span style="color: #98be65;">"less $CONFIG_FILE"</span>
<span style="color: #c678dd;">scut</span> vim     <span style="color: #98be65;">"nvim"</span>
<span style="color: #c678dd;">scut</span> ws      <span style="color: #98be65;">"cd $WORKSPACE"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Marcus Crane</p>
<p class="date">Created: 2020-07-06 Mon 16:40</p>
</div>
</body>
</html>
